In [10]:
str2 = 'text'
str3 = 'Hello World!'

In [11]:
str2

'text'

In [12]:
str3

'Hello World!'

In [16]:
str4 = ['a','b','c']

In [17]:
str4

['a', 'b', 'c']

In [18]:
str5 = ['Hello!', 'World' ,'is', 'good!']

In [19]:
str5

['Hello!', 'World', 'is', 'good!']

In [20]:
str2 + str3

'textHello World!'

In [21]:
str3 + str2

'Hello World!text'

In [22]:
str2 + ' ' + str3

'text Hello World!'

In [23]:
str2 + 1

TypeError: can only concatenate str (not "int") to str

In [25]:
str1 = 'a'

In [26]:
str1

'a'

In [27]:
str1 + 2

TypeError: can only concatenate str (not "int") to str

In [28]:
type(str1)

str

In [30]:
type(2)

int

In [33]:
'현재 온도는 %d입니다' %18 #숫자 바로 대입

'현재 온도는 18입니다'

In [37]:
'I eat %s apples.' % 'five' #문자열 바로 대입

'I eat five apples.'

In [38]:
number = 3
"I eat %d apples." %number #숫자 값을 나타내는 변수로 대입

'I eat 3 apples.'

In [39]:
number = 10
day = "three"
"I ate %d apples. so I was sik for %s days." %(number, day)

'I ate 10 apples. so I was sik for three days.'

In [41]:
"Error is %d%%." % 98

'Error is 98%.'

In [48]:
1,2,3,4,5

(1, 2, 3, 4, 5)

## 221025 복습

In [53]:
import pandas as pd

In [55]:
list_str = ['a','b','c']

In [56]:
print(type(list_str))

<class 'list'>

In [57]:
series_var = pd.Series(list_str)

In [58]:
series_var

0    a
1    b
2    c
dtype: object

In [59]:
type(series_var)

pandas.core.series.Series

In [60]:
series_var

0    a
1    b
2    c
dtype: object

In [61]:
series_var = pd.Series(list_str, index=[3,4,5])

In [62]:
#list의 항목 값을 바꾸는 방식!!

In [63]:
series_var

3    a
4    b
5    c
dtype: object

In [64]:
series_var[3]

'a'

In [65]:
dic={'a':3, 'b':4, 'c':5}

In [66]:
s_dic = pd.Series(dic) #dic를 Series로 바꿈

In [67]:
s_dic

a    3
b    4
c    5
dtype: int64

In [68]:
s_dic['a']

3

In [69]:
dic_p = {'name' : ['hojin', 'yejin', 'sanghyeon', 'sunhyeon'],
    'age' : [20, 25, 28, 19],
    'grade' : ['S', 'A', 'B', 'C']}

In [70]:
df = pd.DataFrame(dic_p)

In [71]:
df

        name  age grade
0      hojin   20     S
1      yejin   25     A
2  sanghyeon   28     B
3   sunhyeon   19     C

In [72]:
type(df)

pandas.core.frame.DataFrame

In [73]:
df['name']

0        hojin
1        yejin
2    sanghyeon
3     sunhyeon
Name: name, dtype: object

In [74]:
type(df['name'])

pandas.core.series.Series

In [75]:
df['age'], df['grade']

(0    20
 1    25
 2    28
 3    19
 Name: age, dtype: int64,
 0    S
 1    A
 2    B
 3    C
 Name: grade, dtype: object)

In [76]:
type(df['age']), type(df['grade'])

(pandas.core.series.Series, pandas.core.series.Series)

#### Series의 항목의 평균, 합, 중간값, 분산, 표준편차, 최대값, 최소값 구하기 (int64만 가능!!!!)

In [77]:
df['age'].mean()

23.0

In [78]:
df['age'].sum()

92

In [79]:
df['age'].median()

22.5

In [80]:
df['age'].var()

18.0

In [81]:
df['age'].std()

4.242640687119285

In [82]:
df['age'].max()

28

In [83]:
df['age'].min()

19

In [84]:
df

        name  age grade
0      hojin   20     S
1      yejin   25     A
2  sanghyeon   28     B
3   sunhyeon   19     C

In [85]:
df.shape #(data, 속성)

(4, 3)

In [86]:
df.isnull()

    name    age  grade
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [87]:
df.isnull().sum()

name     0
age      0
grade    0
dtype: int64

In [89]:
dic_p = {
    'name' : ['hojin', 'yejin', 'sanghyeon', 'sunhyeon'],
    'age' : [20, 25, None, 19],
    'grade' : ['S', 'A', 'B', 'C']
} #null 값 입력후 info와 isnull 살펴보기

In [91]:
df = pd.DataFrame(dic_p)

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     3 non-null      float64
 2   grade   4 non-null      object
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [93]:
df.isnull().sum()

name     0
age      1
grade    0
dtype: int64

In [94]:
df.columns #column : 속성, attribute 속성 값은 복붙을 이용할것!

Index(['name', 'age', 'grade'], dtype='object')

In [95]:
for col in df.columns :
    print(col)

name
age
grade

In [96]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [97]:
list(df.index)

[0, 1, 2, 3]

In [98]:
df

        name   age grade
0      hojin  20.0     S
1      yejin  25.0     A
2  sanghyeon   NaN     B
3   sunhyeon  19.0     C

In [99]:
df = pd.DataFrame(dic_p, index = ['a','b','c','d'])

In [101]:
df # df의 항목값을 변경

        name   age grade
a      hojin  20.0     S
b      yejin  25.0     A
c  sanghyeon   NaN     B
d   sunhyeon  19.0     C

In [102]:
df.loc['a']

name     hojin
age       20.0
grade        S
Name: a, dtype: object

In [103]:
df.loc['a']['age']

20.0

In [104]:
df.iloc[1]

name     yejin
age       25.0
grade        A
Name: b, dtype: object

In [105]:
df.iloc[0]

name     hojin
age       20.0
grade        S
Name: a, dtype: object

In [106]:
df.iloc[1:]

        name   age grade
b      yejin  25.0     A
c  sanghyeon   NaN     B
d   sunhyeon  19.0     C

In [108]:
df.loc['a':'d']  #loc 와 iloc 둘 다 인덱싱과 슬라이싱 가능!

        name   age grade
a      hojin  20.0     S
b      yejin  25.0     A
c  sanghyeon   NaN     B
d   sunhyeon  19.0     C

In [109]:
# age가 필요 없고, grade랑 name 만 살펴보고 싶을 때,
df

        name   age grade
a      hojin  20.0     S
b      yejin  25.0     A
c  sanghyeon   NaN     B
d   sunhyeon  19.0     C

In [110]:
df[['name','grade']]

        name grade
a      hojin     S
b      yejin     A
c  sanghyeon     B
d   sunhyeon     C

In [116]:
df2 = df[['name','grade']]

In [117]:
df2

        name grade
0      hojin     S
1      yejin     A
2  sanghyeon     B
3   sunhyeon     C

In [112]:
dic_p = {
    'name' : ['hojin', 'yejin', 'sanghyeon', 'sunhyeon'],
    'age' : [20, 25, 32, 33],
    'grade' : ['S', 'A', 'B', 'C']
}

In [113]:
df = dic_p

In [114]:
df = pd.DataFrame(dic_p)

In [115]:
df

        name  age grade
0      hojin   20     S
1      yejin   25     A
2  sanghyeon   32     B
3   sunhyeon   33     C

In [118]:
df[df['age']< 30] #역시 int 만 가능!

    name  age grade
0  hojin   20     S
1  yejin   25     A

In [119]:
df[df['age']>30]

        name  age grade
2  sanghyeon   32     B
3   sunhyeon   33     C

In [127]:
df[(df['age'] > 30) & (df['grade'] == 'B')]

        name  age grade
2  sanghyeon   32     B

In [128]:
df['grade'].str.lower()

0    s
1    a
2    b
3    c
Name: grade, dtype: object

In [129]:
df[(df['age'] > 30) & (df['grade'].str.lower() == 'b')]

        name  age grade
2  sanghyeon   32     B

In [130]:
df['name'] = df['name'].str.upper()

In [131]:
df

        name  age grade
0      HOJIN   20     S
1      YEJIN   25     A
2  SANGHYEON   32     B
3   SUNHYEON   33     C

In [132]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [133]:
df = df[0]

In [134]:
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [135]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 563 entries, 0 to 562
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Bank NameBank            563 non-null    object
 1   CityCity                 563 non-null    object
 2   StateSt                  563 non-null    object
 3   CertCert                 563 non-null    int64
 4   Acquiring InstitutionAI  563 non-null    object
 5   Closing DateClosing      563 non-null    object
 6   FundFund                 563 non-null    int64
dtypes: int64(2), object(5)
memory usage: 30.9+ KB

In [137]:
df['CityCity'].value_counts()

Chicago         20
Atlanta         10
Phoenix          6
Naples           5
Scottsdale       4
                ..
East Ellijay     1
Rosemount        1
Carthage         1
Winter Park      1
Honolulu         1
Name: CityCity, Length: 433, dtype: int64

In [139]:
df['StateSt'].value_counts()

GA    93
FL    76
IL    69
CA    41
MN    23
WA    19
AZ    16
MO    16
MI    14
TX    13
NV    12
KS    11
WI    11
SC    10
CO    10
MD    10
PA    10
OH     9
NJ     8
UT     8
NC     7
AL     7
OK     7
TN     7
OR     6
VA     5
NY     5
PR     4
AR     4
LA     4
NE     4
NM     3
IN     3
KY     3
WV     2
IA     2
MS     2
CT     2
ID     2
MA     1
SD     1
WY     1
NH     1
HI     1
Name: StateSt, dtype: int64

## 10/25 1.Pandas , 2.Hackton 복습할 것